{
    "class_name": "Sequential",
    "config": [
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_6",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    null,
                    1
                ],
                "dtype": "float32",
                "return_sequences": true,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "implementation": 0,
                "units": 50,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_6",
                "trainable": true,
                "rate": 0.2
            }
        },
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_7",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    null,
                    50
                ],
                "dtype": "float32",
                "return_sequences": true,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "implementation": 0,
                "units": 100,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_7",
                "trainable": true,
                "rate": 0.2
            }
        },
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_8",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    null,
                    50
                ],
                "dtype": "float32",
                "return_sequences": true,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "implementation": 0,
                "units": 100,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_8",
                "trainable": true,
                "rate": 0.2
            }
        },
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_9",
                "trainable": true,
                "batch_input_shape": [
                    null,
                    null,
                    50
                ],
                "dtype": "float32",
                "return_sequences": true,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "implementation": 0,
                "units": 100,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_9",
                "trainable": true,
                "rate": 0.2
            }
        },
        {
            "class_name": "LSTM",
            "config": {
                "name": "lstm_10",
                "trainable": true,
                "return_sequences": false,
                "go_backwards": false,
                "stateful": false,
                "unroll": false,
                "implementation": 0,
                "units": 100,
                "activation": "tanh",
                "recurrent_activation": "hard_sigmoid",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": {
                        "gain": 1.0,
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "unit_forget_bias": true,
                "kernel_regularizer": null,
                "recurrent_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "recurrent_constraint": null,
                "bias_constraint": null,
                "dropout": 0.0,
                "recurrent_dropout": 0.0
            }
        },
        {
            "class_name": "Dropout",
            "config": {
                "name": "dropout_10",
                "trainable": true,
                "rate": 0.2
            }
        },
        {
            "class_name": "Dense",
            "config": {
                "name": "dense_2",
                "trainable": true,
                "units": 1,
                "activation": "linear",
                "use_bias": true,
                "kernel_initializer": {
                    "class_name": "VarianceScaling",
                    "config": {
                        "scale": 1.0,
                        "mode": "fan_avg",
                        "distribution": "uniform",
                        "seed": null
                    }
                },
                "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                },
                "kernel_regularizer": null,
                "bias_regularizer": null,
                "activity_regularizer": null,
                "kernel_constraint": null,
                "bias_constraint": null
            }
        },
        {
            "class_name": "Activation",
            "config": {
                "name": "activation_2",
                "trainable": true,
                "activation": "linear"
            }
        }
    ],
    "keras_version": "2.0.1",
    "backend": "tensorflow"
}